// HOF - Hight order function (функции высшего порядка)
// функция высшего порядка может принимать как параметр другую ф-цию и(или) возвращать другую функцию

// Функция обратного вызова - ее вызыват интерпетатор в нужный момент
// Callback function

// Функция обратного вызова - это функция, которая передается другой функции в качестве аргумента и та, в сыою очередь вызывает переденную функцию

// ===========================================
// Claculator;

// =============================
// Event Listeners
