// this - Контекст вызова
// this - это тот кто вызывает функцию
// Не важно где обьявлена ф-ция, важно кто ее вызывает

// ============================================
// this in global functions and global scope

// ============================================
// this in objects and methods

// ======================================
// this in callback functions lost contecst

// ======================================
// this in arrow functions контекст береться з місця її написання

// =============================================
// this in event listeners

// ======================================
//  this in ES5 Clases

// ==================================
// this in ES6 Clases
